Revit 2026 API

# IFCProductWrapper Class

---

This class is used to ensure that elements and objects are associated with the current IfcProduct.

SystemObject Autodesk.Revit.DB.IFCIFCProductWrapper

**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class IFCProductWrapper : IDisposable
```
```vb
Public Class IFCProductWrapper
	Implements IDisposable
```
```cpp
public ref class IFCProductWrapper : IDisposable
```
```fsharp
type IFCProductWrapper =
    class
        interface IDisposable
    end
```

The IFCProductWrapper type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Count | The number of objects associated with the IfcProduct in this wrapper. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

|  | Name | Description |
| --- | --- | --- |
|  | AddAnnotation | Adds an annotation handle to associate with the IfcProduct in this wrapper. |
|  | AddBuilding | Adds an IfcBuilding handle to associate with the IfcProduct in this wrapper. |
|  | AddElement | Adds an IfcElement handle to associate with the IfcProduct in this wrapper. |
|  | AddFinishMaterial | Adds a material handle to associate with the IfcProduct in this wrapper. |
|  | AddSite | Adds a site (IfcObject) handle to associate with the IfcProduct in this wrapper. |
|  | AddSpace | Adds an IfcSpace handle to associate with the IfcProduct in this wrapper. |
|  | ClearFinishMaterials | Clear finish materials in this wrapper. |
|  | Create(IFCProductWrapper) | Establishes a new product manager for elements and objects derived from a parent product manager. |
|  | Create(ExporterIFC, Boolean) | Establishes a new baseline product manager for elements and objects. |
|  | Create(IFCProductWrapper, Boolean) | Establishes a new product manager for elements and objects derived from a parent product manager, allowing override of allowRelateToLevel |
|  | Dispose | Releases all resources used by the IFCProductWrapper |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | FindExtrusionCreationParameters | Obtains the extrusion creation data associated with the given element. |
|  | GetAllObjects | Gets all objects associated with the IfcProduct in this wrapper. |
|  | GetAnElement | Gets the first element handle added to this wrapper. |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

Each instance makes sure that any elements and products created during its lifetime are properly associated to their parent level (or other containing object). To ensure that the lifetime of the object is correctly managed, you should declare an instance of this class as a part of a 'using' statement in C# or similar construct in other lanuguages.

#### Reference

Autodesk.Revit.DB.IFC Namespace